//
//  EGEInfo.swift
//  PhysicsApp
//
//  Created by Evgeny Kamaev on 09.05.2020.
//  Copyright © 2020 Devgen. All rights reserved.
//

import Foundation

class EGEInfo {
    // Номера заданий в ЕГЭ базового уровня
    static let baseTasks = [1,2,3,4,8,9,10,13,14,15,19,20,22,23]
    
    // Номера заданий в ЕГЭ повышенного уровня
    static let advancedTasks = [5,6,7,11,12,16,17,18,21,24,25,26,28]
    
    // Номера заданий в ЕГЭ высокого уровня
    static let masterTasks = [27,29,30,31,32]
    
    // Первичные баллы за каждое задание
    static let primarySystem = [1,1,1,1,2,2,2,1,1,1,2,2,1,1,1,2,2,2,1,1,2,1,1,2,1,1,3,2,3,3,3,3]
    
    // Стобальная система перевода баллов из первичных
    static let hundredSystem = [0,3,6,9,12,15,18,21,24,27,30,33,36,38,39,40,41,43,44,45,46,48,49,50,51,53,54,55,56,58,59,60,61,63,64,66,68,70,72,74,76,78,80,81,83,85,87,89,91,93,95,97,99,100]
    
    // Все темы ЕГЭ
    static let egeSystemThemes = ["Электродинамика","Механика","МКТ","Квантовая физика"]
    
    // Все задания ЕГЭ
    static let egeSystemTasks = ["Задание №1","Задание №2","Задание №3","Задание №4","Задание №5","Задание №6","Задание №7","Задание №8","Задание №9","Задание №10","Задание №11","Задание №12","Задание №13","Задание №14","Задание №15","Задание №16","Задание №17","Задание №18","Задание №19","Задание №20","Задание №21","Задание №22","Задание №23","Задание №24","Задание №25","Задание №26","Задание №27","Задание №28","Задание №29","Задание №30","Задание №31","Задание №32"]
    
    private init() {
        
    }
}
